# RebarInternalMultiplanar Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarInternalMultiplanar Property
ParameterTypeId Class See Also
---
"INTERNAL: Multiplanar"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarInternalMultiplanar { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarInternalMultiplanar As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarInternalMultiplanar {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace